Revit 2027 API
MEPSize.OuterDiameter Property
 Outer diameter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OuterDiameter { get; }
Public ReadOnly Property OuterDiameter As Double
	Get
public:
property double OuterDiameter {
	double get ();
}
member OuterDiameter : float with get
Property Value
Double
See Also
Reference
MEPSize Class
Autodesk.Revit.DB Namespace